import math

# =============================================================================
#     +     for a + b
#     -     for a - b
#     /     for a / b
#     *     for a * b
# =============================================================================

def main():
    op = input(
        'Какую операцию Вы хотите осуществить?\
        \nВыберите операцию "+, -, *, /" : ')

    a = int(input('Введите первое число: '))
    b = int(input('Введите второе число: '))

    if op == '+':
        print(str(a) + ' ' + op + ' ' + str(b) + ' = ' + str(a + b))
    elif op == '-':
        print(str(a) + ' ' + op + ' ' + str(b) + ' = ' + str(a - b))
    elif op == '*':
        print(str(a) + ' ' + op + ' ' + str(b) + ' = ' + str(a * b))
    elif op == '/':
        if b == 0:
            print('Ошибка деления на 0')
        else:
            print(str(a) + ' ' + op + ' ' + str(b) + ' = ' + str(a / b))
    else:
        print("Некорректный оператор")

if __name__ == '__main__':
    main()
